artillery_load_tests/artillery_local_api.yml
config:
  # It's designed to be highly scalable
  payload:
    # path is relative to the location of the test script
    path: "users.csv"
    fields:
      - "username"
      - "title"
      - "content"

  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 2000
        - http.response_time.p95: 500
scenarios:
  - flow:
      - loop:
        - post:
            url: "/careers/"
            json:
              username: "{{ username }}"
              title: "{{ title }}"
              content: "{{ content }}"
        - get:
            url: "/careers/"
        count: 100